"""
글로벌시스템융합과 프로그래밍(1) 실습 문제

실습 2: 로그인 시스템

아이디와 비밀번호를 입력받아 로그인 결과를 출력하세요.
중첩 if문을 사용합니다.

[판정 기준]
- 정답 아이디: "admin"
- 정답 비밀번호: "1234"

- 아이디가 맞으면:
  - 비밀번호가 맞으면: "로그인 성공!"
  - 비밀번호가 틀리면: "비밀번호가 틀렸습니다."
- 아이디가 틀리면: "ID가 존재하지 않습니다."
"""

user_id = input("아이디를 입력하세요: ")
password = input("비밀번호를 입력하세요: ")

# 아래에 중첩 if문을 작성하세요

# 정답 아이디와 정답 비밀번호
answer_id = "admin"
answer_password = "1234"

# 아이디가 맞으면
if user_id == answer_id:
  # 비밀번호가 맞으면 "로그인 성공!"
    if password == answer_password:
        print("로그인 성공!")
  # 그 외는 "비밀번호가 틀렸습니다."
    else:
        print("비밀번호가 틀렸습니다.")

# 그 외는 "ID가 존재하지 않습니다."
else:
    print("ID가 존재하지 않습니다.")
