"""
글로벌시스템융합과 프로그래밍(1) 실습 문제

실습 2: 계절 판별

월(1~12)을 입력받아 계절을 출력하세요.
if/elif/else를 사용합니다.

[계절 기준]
3, 4, 5월: 봄
6, 7, 8월: 여름
9, 10, 11월: 가을
12, 1, 2월: 겨울
"""

month = int(input("월을 입력하세요 (1~12): "))

# 아래에 계절을 판정하여 출력하세요

# 만약 3, 4, 5 을 입력받았을 경우 "{month}월은 봄입니다."을 출력한다.
if 3 <= month <= 5:
    print(f"{month}월은 봄입니다.")

# 그게 아니라면 6, 7, 8 을 입력받았을 경우 "{month}월은 여름입니다."을 출력한다.
elif 6 <= month <= 8:
    print(f"{month}월은 여름입니다.")

# 그게 아니라면 9, 10, 11 을 입력받았을 경우 "{month}월은 가을입니다."을 출력한다.
elif 9 <= month <= 11:
    print(f"{month}월은 가을입니다.")

# 이외의 나머지는 "{month}월은 겨울입니다."을 출력한다.
else:
    print(f"{month}월은 겨울입니다.")
